# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# from shlex import quote
# from string import ascii_lowercase

alice_in_wonderland = (
        "'Would you tell me, please, which way I ought to go from here?' \n"
        "'That depends a good deal on where you want to get to', " "—— said the Cat \n"
        "'I don't much care where', " " —— said Alice. \n"
        "'Then it doesn't matter which way you go, " "—— said the Cat. \n"
        "'—— so long as I get somewhere', " "—— Alice added as an explanation. \n"
        "'Oh, you're sure to do that', " "—— said the Cat, " "'if you only walk long enough.' \n"
                       )

# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
symbol = "'"
count_symbol = alice_in_wonderland.count(symbol)
print(f"Символ '{symbol}' зустрічається {count_symbol} раз(ів)")

# task 03 == Виведіть змінну alice_in_wonderland на друк
print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
Black_Sea_area = 436402 # км2 площа Чорного моря
Azov_See_area = 37800 # км2 площа Азовського моря
Total_area = Black_Sea_area + Azov_See_area # площа, яку займають Чорне та Азовське моря разом
print(f"Task 04: площа, яку займають Чорне та Азовське моря разом = {Total_area} км2")

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_goods = 375291 # загальна кількість товарів на 3-х складах
stor_1_and_stor_2 = 250449 # кількість товарів на 1-му та 2-му складах
stor_2_and_stor_3 = 222950 # кількість товарів на 2-му та 3-му складах
storage_3 = total_goods - stor_1_and_stor_2 # знайдемо кількість товарів на 3 складі
storage_1 = total_goods - stor_2_and_stor_3 # знайдемо кількість товарів на 1 складі
stor_1_and_stor_3 = storage_1 + storage_3 # сума товарів на 1 та 3 складі
storage_2 = total_goods - stor_1_and_stor_3 # сума товарів на 2 складі
print(f"Task 05: кількість товарів, що розміщені на 1 складі = {storage_1}, на 2 складі = {storage_2}, на 3 складі = {storage_3}")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
payment_period = 12 + 6 # 1,5 року це повний рік і ще половина від кількості місяців у році
computer_cost = payment_period * 1179 # вартість комп'ютера за 1,5 року
print(f"Task 06: вартість комп'ютера = {computer_cost} грн")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print(f"Task 07: a) = {a}, b) = {b}, c) = {c}, d) = {d}, e) = {e}, f) = {f}")

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
goods_sum = 4*274 + 2*218 + 4*35 + 1*350 + 3*21 # помножимо кількість кожного товару на його ціну та додамо результати
print(f"Task 08: сума грошей, яка потрібна на день народження = {goods_sum} грн")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
number_of_pages = 232 / 8 # загальна кількість сторінок альбому
rounded_pages = round(number_of_pages)
print(f"Task 09: кількість сторінок, яка потрібна Ігорю, щоб вклеїти усі фото = {rounded_pages}")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""

total_amount_of_petrol = (1600 / 100) * 9 # 1) кількість л бензину потрібної для подорожі з Харкова до Будапешту
number_of_stops = total_amount_of_petrol / 48 # 2) кількість зупинок для того, щоб заправити повністю бак
rounded_stops = round(number_of_stops)
print(f"Task 10: кількість бензину = {total_amount_of_petrol} л, кількість зупинок = {rounded_stops}")