# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вставте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print("Hello world!")

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = 4 * apples

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
# спочатку об'явимо наші значення відповідно до умови задачі
# У саду посадили 4 яблуні:
apples = 4
# Груш на 5 більше яблунь, отже потрібно до константи яблука додати ще 5 одиниць:
pear = apples + 5
# слив - на 2 менше, отже потрібно від константи яблук відняти 2 одиниці:
plum = apples - 2
# тепер порахуємо суму усіх дерев та виведемо результат на екран:
tree_sum = apples + pear + plum
print(tree_sum)

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
# спочатку об'явимо наші значення відповідно до умови задачі
# до обіду температура повітря була на 5 градусів вище нуля:
zero_temperature = 0
temperature_before_lunch = 0 + 5
# Після обіду температура опустилася на 10 градусів, отже потрібно
# від значення дообідньої температури відняти 10 одиниць:
temperature_after_lunch = temperature_before_lunch - 10
# Надвечір потепліло на 4 градуси, отже потрібно
# до післяобідньої температури додати 4 одиниці:
evening_temperature = temperature_after_lunch + 4
# тепер виведемо значення вечірньої температури на екран:
print(evening_temperature)

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скільки сьогодні дітей у театральному гуртку?
"""
# спочатку об'явимо наші значення відповідно до умови задачі
# у театральному гуртку - 24 хлопчики:
boys = 24
# дівчаток - вдвічі менше, отже потрібно кількість хлопців поділити на 2:
girls = boys / 2
# тепер порахуємо загальну кількість дітей:
all_kids = boys + girls
# порахуємо суму дітей, які сьогодні не прийшли, це 1 хлопчик та 2 дівчинки:
missing_kids = 1 + 2
# а тепер порахуємо та виведемо на екран кількість дітей сьогодні:
kids_today = all_kids - missing_kids
print(int(kids_today))

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дорожче,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
# спочатку об'явимо наші значення відповідно до умови задачі
# Перша книжка коштує 8 грн:
book_1 = 8
# друга - на 2 грн дорожче, отже потрібно до вартості першої книжки додати 2 грн:
book_2 = book_1 + 2
# а третя - як половина вартості першої та другої разом:
book_3 = (book_1 + book_2) / 2
# тепер порахуємо скільки будуть коштувати усі книги, якщо купити по одному примірнику:
book_sum = book_1 + book_2 + book_3
print(int(book_sum))
